/* tsb12lv23.c - TSB12LV23 typedef and defines */

/* Copyright(c) 1999, Sederta Inc. All rights reserved. */

/*
modification history
--------------------
01f,10Oct00,spa Raise to 50 the number of retry to read the phy layer
01e,31Aug00,spa Merge 4 UINT16 (CAP_ID PM_CAP PM_CSR PM_Ext) into
                2 UINT32 (CAP and PM) in the chip mapping.
01d,28Jun00,spa Added Posted Write Addr Hi register mapping.
01c,14Jun00,spa Changed tabulation
01b,30May00,spa Added event ack codes
01a,12May00,spa This file was created.
*/

/*
This module contains specific typedef and defines for the Texas Instrument
IEEE 1394 link layer layer TSB12LV23.

INCLUDES FILES: sdtypes.h
*/

#ifndef __INCtsb12lv23h
#define __INCtsb12lv23h

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* includes */
#include "stdint.h"

/* defines */

#define TSB12LV23_MAX_GEN_CNT 255           /* Roll over for generation count */

#define TSB12LV23_MAX_NB_ISO_RX_CTX         32
#define TSB12LV23_MAX_NB_ISO_TX_CTX         32
#define TSB12LV23_NB_ASY_CTX                4

/*
 * Register offsets
 */
#define TSB12LV23_OHCI_VERSION          0x0000  /* OHCI Verison + ROM supp. */
#define TSB12LV23_GUID_ROM              0x0004  /* ROM access               */
#define TSB12LV23_AT_RETRIES            0x0008  /* Nb retry for Async Tx    */
#define TSB12LV23_CSR_DATA              0x000c  /* To access the host CSR   */

/* Isochronous transmit event register */
#define TSB12LV23_ISO_TX_INT_EVENT_SET  0x0090  /* Iso Tx event             */
#define TSB12LV23_ISO_TX_INT_EVENT_CLR  0x0094
#define TSB12LV23_ISO_TX_MASK_EVENT_SET 0x0098  /* Iso Tx mask              */
#define TSB12LV23_ISO_TX_MASK_EVENT_CLR 0x009c
/* Isochronous receive event register */
#define TSB12LV23_ISO_RX_INT_EVENT_SET  0x00a0  /* Iso Rx event             */
#define TSB12LV23_ISO_RX_INT_EVENT_CLR  0x00a4
#define TSB12LV23_ISO_RX_MASK_EVENT_SET 0x00a8  /* Iso Rx mask              */
#define TSB12LV23_ISO_RX_MASK_EVENT_CLR 0x00ac
/* Fairness control */
#define TSB12LV23_FAIRNESS_CONTROL      0x00dc
/* Link core protocol control */
#define TSB12LV23_LINK_CONTROL_SET      0x00e0
#define TSB12LV23_LINK_CONTROL_CLR      0x00e4
/* Node identification */
#define TSB12LV23_NODE_ID               0x00e8  /* Read-only. Node #        */
/* PHY access */
#define TSB12LV23_PHY_CONTROL           0x00ec  /* Access to phy registers  */
/* Isochronous reference cycle timer */
#define TSB12LV23_ISO_CYCLE_TIMER       0x00f0
/* This registers handle the async reception on a per node basis */
#define TSB12LV23_ASY_REQ_FILTER_HI_SET 0x0100
#define TSB12LV23_ASY_REQ_FILTER_HI_CLR 0x0104
#define TSB12LV23_ASY_REQ_FILTER_LO_SET 0x0108
#define TSB12LV23_ASY_REQ_FILTER_LO_CLR 0x010c
#define TSB12LV23_PHY_REQ_FILTER_HI_SET 0x0110
#define TSB12LV23_PHY_REQ_FILTER_HI_CLR 0x0114
#define TSB12LV23_PHY_REQ_FILTER_LO_SET 0x0118
#define TSB12LV23_PHY_REQ_FILTER_LO_CLR 0x011c
/* Upper bound register */
#define TSB12LV23_PHY_UPPER_BOUND       0x0120  /* NOT IMPLEMENTED  */
/* Asynchronous request transmit */
#define TSB12LV23_ATRQ_CTRL_SET         0x0180
#define TSB12LV23_ATRQ_CTRL_CLR         0x0184
#define TSB12LV23_ATRQ_CMD_PTR          0x018c
/* Asynchronous response transmit */
#define TSB12LV23_ATRS_CTRL_SET         0x01a0
#define TSB12LV23_ATRS_CTRL_CLR         0x01a4
#define TSB12LV23_ATRS_CMD_PTR          0x01ac
/* Asynchronous request receive */
#define TSB12LV23_ARRQ_CTRL_SET         0x01c0
#define TSB12LV23_ARRQ_CTRL_CLR         0x01c4
#define TSB12LV23_ARRQ_CMD_PTR          0x01cc
/* Asynchronous response receive */
#define TSB12LV23_ARRS_CTRL_SET         0x01e0
#define TSB12LV23_ARRS_CTRL_CLR         0x01e4
#define TSB12LV23_ARRS_CMD_PTR          0x01ec
/* Isochronous Transmit context (base + 16 * no) */
#define TSB12LV23_ISO_TX_CTRL_SET(_CTX_NB)      (0x0200 + (_CTX_NB << 4))
#define TSB12LV23_ISO_TX_CTRL_CLR(_CTX_NB)      (0x0204 + (_CTX_NB << 4))
#define TSB12LV23_ISO_TX_CMD_PTR(_CTX_NB)       (0x020c + (_CTX_NB << 4))
/* Isochronous Receive context (base + 32 * no) */
#define TSB12LV23_ISO_RX_CTRL_SET(_CTX_NB)      (0x0400 + (_CTX_NB << 5))
#define TSB12LV23_ISO_RX_CTRL_CLR(_CTX_NB)      (0x0404 + (_CTX_NB << 5))
#define TSB12LV23_ISO_RX_CMD_PTR(_CTX_NB)       (0x040c + (_CTX_NB << 5))
#define TSB12LV23_ISO_CTX_MATCH(_CTX_NB)        (0x0410 + (_CTX_NB << 5))

/* globals */

typedef struct
    {
    struct ctxControlReg
        {
        uint32_t set;
        uint32_t clear;
        } ctxControl;
    uint32_t    reserved2;
    uint32_t    commandPtr;
    } lv23Context_t;

typedef struct
    {
    struct IsoCtxCtrlReg
        {
        uint32_t set;
        uint32_t clear;
        } ctxControl;
    uint32_t    reserved1;
    uint32_t    commandPtr;
    uint32_t    contextMatch;
    uint32_t    reserved[3];
    } lv23IsoRxContext_t;

typedef struct tsb12lv23
    {
    uint32_t    version;        /* 00h */
    uint32_t    GUID_ROM;       /* 04h */
    uint32_t    ATRetries;      /* 08h */
    uint32_t    csrData;        /* 0Ch */
    uint32_t    csrCompareData; /* 10h */
    uint32_t    csrControl;     /* 14h */
    uint32_t    configRomHdr;   /* 18h */
    uint32_t    busId;          /* 1Ch */
    uint32_t    busOptions;     /* 20h */
    uint32_t    guiIdHi;        /* 24h */
    uint32_t    guiIdLo;        /* 28h */
    uint32_t    SSID;           /* 2Ch */
    uint32_t    reserved30;     /* 30h */
    uint32_t    configROMmap;       /* 34h */
    uint32_t    postedWriteAddrLo;  /* 38h */
    uint32_t    postedWriteAddrHi;  /* 3Ch */
    uint32_t    vendorId;       /* 40h */
    uint32_t    CAP;            /* 44h */
    uint32_t    PM;             /* 48h */
    uint32_t    reserved4c;     /* 4Ch */
    struct  hcControlHdr
        {
        uint32_t set;       /* 50h */
        uint32_t clr;   /* 54h */
        }hcControl;
    uint32_t    reserved58_60[3];   /* 58h - 60h */
    uint32_t    selfIdBuffer;       /* 64h */
    uint32_t    selfIdCount;        /* 68h */
    uint32_t    reserved6c;         /* 6Ch */
    struct  irChannelMaskHiReg
        {
        uint32_t set;           /* 70h */
        uint32_t clr;           /* 74h */
        }irChannelMaskHi;
    struct  irChannelMaskLoReg
        {
        uint32_t set;           /* 78h */
        uint32_t clr;           /* 7Ch */
        } irChannelMaskLo;
    struct  intEventReg
        {
        uint32_t set;           /* 80h */
        uint32_t clr;           /* 84h */
        } intEvent;
    struct  intMaskReg
        {
        uint32_t set;               /* 88h */
        uint32_t clr;               /* 8Ch */
        } intMask;
    struct  isoTxIntEventReg
        {
        uint32_t set;               /* 90h */
        uint32_t clr;               /* 94h */
        } isoTxIntEvent;
    struct  isoTxIntMaskReg
        {
        uint32_t set;               /* 98h */
        uint32_t clr;               /* 9Ch */
        } isoTxIntMask;
    struct  isoRxIntEventReg
        {
        uint32_t set;               /* A0h */
        uint32_t clr;               /* A4h */
        } isoRxIntEvent;
    struct  isoRxIntMaskReg
        {
        uint32_t set;               /* A8h */
        uint32_t clr;               /* ACh */
        } isoRxIntMask;
    uint32_t    initialBandwidthAv;     /* B0h */
    uint32_t    initialChannelsAvHi;    /* B4h */
    uint32_t    initialChannelsAvLo;    /* B8h */
    uint32_t    reservedbc_d8[8];       /* BCh - D8h */
    uint32_t    fairnessControl;        /* DCh */
    struct  linkControlReg
        {
        uint32_t set;                   /* E0h */
        uint32_t clr;               /* E4h */
        } linkControl;
    uint32_t    nodeId;             /* E8h */
    uint32_t    phyControl;         /* ECh */
    uint32_t    isoCycleTimer;      /* F0h */
    uint32_t    reservedf4_fc[3];   /* F4h - FCh */
    struct  asyncReqFilterHiReg
        {
        uint32_t set;               /* 100h */
        uint32_t clr;           /* 104h */
        } asyncReqFilterHi;
    struct  asyncReqFilterLoReg
        {
        uint32_t set;               /* 108h */
        uint32_t clr;           /* 10Ch */
        } asyncReqFilterLo;
    struct  phyReqFilterHiReg
        {
        uint32_t set;               /* 110h */
        uint32_t clr;           /* 114h */
        } phyReqFilterHi;
    struct  phyReqFilterLoReg
        {
        uint32_t set;               /* 118h */
        uint32_t clr;           /* 11Ch */
        } phyReqFilterLo;
    uint32_t            phyUpperBound;          /* 120h */
    uint32_t            reserved124_17c[23];    /* 124h - 17Ch */
    lv23Context_t   ATRQ;                   /* 180h - 18Ch */
    uint32_t            reserved190_19c[4];     /* 190h - 19Ch */
    lv23Context_t   ATRS;                   /* 1A0h - 1ACh */
    uint32_t            reserved1b0_1bc[4];     /* 1B0h - 1BCh */
    lv23Context_t   ARRQ;                   /* 1C0h - 1CCh */
    uint32_t            reserved1d0_1dc[4];     /* 1DCh - 1CCh */
    lv23Context_t   ARRS;                   /* 1E0h - 1ECh */
    uint32_t            reserved1f0_1ff[4];     /* 1F0h - 1FCh */
    lv23Context_t       IsoTxContext[32];
    lv23IsoRxContext_t  IsoRxContext[32];
    } tsb12lv23_t;


/*
 * Definition of interrupts event bits
 */

#define TSB12LV23_INT_REQ_TX_COMPLETE       0x00000001
#define TSB12LV23_INT_RES_TX_COMPLETE       0x00000002
#define TSB12LV23_INT_ARRQ                  0x00000004
#define TSB12LV23_INT_ARRS                  0x00000008
#define TSB12LV23_INT_RQ_PKT                0x00000010
#define TSB12LV23_INT_RS_PKT                0x00000020
#define TSB12LV23_INT_ISO_TX                0x00000040
#define TSB12LV23_INT_ISO_RX                0x00000080
#define TSB12LV23_INT_POSTED_WRITE_ERR      0x00000100
#define TSB12LV23_INT_LOCK_RESP_ERR         0x00000200
#define TSB12LV23_INT_SELF_ID_COMPLETE2     0x00008000
#define TSB12LV23_INT_SELF_ID_COMPLETE      0x00010000
#define TSB12LV23_INT_BUS_RESET             0x00020000
